[LWS_Hoplite X2SoldierClassTemplate]
DisplayName="重装者"
ClassSummary="重装者接受了广泛的盾牌、手枪和手榴弹使用训练。他们擅长保护队友，同时惩罚那些过于接近的敌人。"
LeftAbilityTreeTitle="骑士"
RightAbilityTreeTitle="特警"
AbilityTreeTitles[0]="骑士"
AbilityTreeTitles[1]="维京战士"
AbilityTreeTitles[2]="特警"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL ORDER
RandomNickNames[0]="黑桃A"
RandomNickNames[1]="暴行"
RandomNickNames[2]="幕后黑手"
RandomNickNames[3]="痛击"
RandomNickNames[4]="黑死病"
RandomNickNames[5]="碎骨者"
RandomNickNames[6]="冷血"
RandomNickNames[7]="寒潮"
RandomNickNames[8]="守墓人"
RandomNickNames[9]="死亡商人"
RandomNickNames[10]="恶魔"
RandomNickNames[11]="末日"
RandomNickNames[12]="龙"
RandomNickNames[13]="肖像"
RandomNickNames[14]="邪恶天才"
RandomNickNames[15]="堕落天使"
RandomNickNames[16]="火球"
RandomNickNames[17]="齿轮"
RandomNickNames[18]="九头蛇"
RandomNickNames[19]="伊夫里特"
RandomNickNames[20]="折叠刀"
RandomNickNames[21]="喷气机"
RandomNickNames[22]="熄灯"
RandomNickNames[23]="法师"
RandomNickNames[24]="岩浆"
RandomNickNames[25]="牛头人"
RandomNickNames[26]="单翼天使"
RandomNickNames[27]="陷阱"
RandomNickNames[28]="瘟疫"
RandomNickNames[29]="降雨"
RandomNickNames[30]="响尾蛇"
RandomNickNames[31]="反弹"
RandomNickNames[32]="红死病"
RandomNickNames[33]="崛起"
RandomNickNames[34]="撕裂者"
RandomNickNames[35]="火蜥蜴"
RandomNickNames[36]="尖叫"
RandomNickNames[37]="送行"
RandomNickNames[38]="阴影"
RandomNickNames[39]="勒索"
RandomNickNames[40]="灼热"
RandomNickNames[41]="狡猾"
RandomNickNames[42]="开火"
RandomNickNames[43]="烧焦"
RandomNickNames[44]="灵魂收割者"
RandomNickNames[45]="幽灵"
RandomNickNames[46]="唾沫休息"
RandomNickNames[47]="战术核弹"
RandomNickNames[48]="拆毁"
RandomNickNames[49]="恐怖"
RandomNickNames[50]="墓碑"
RandomNickNames[51]="毒液"
RandomNickNames[52]="毒蛇"
RandomNickNames[53]="战狗"
RandomNickNames[54]="巫师"
RandomNickNames[55]="愤怒"
RandomNickNames[56]="雪人"
RandomNickNames[57]="零"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="魔王"
RandomNickNames_Male[1]="消防员"
RandomNickNames_Male[2]="统治者"
RandomNickNames_Male[3]="狼爸"
RandomNickNames_Female[0]="余烬"
RandomNickNames_Female[1]="女皇"
RandomNickNames_Female[2]="熊妈"
RandomNickNames_Female[3]="女巫"
;ALPHABETICAL ORDER

PhotoboothSoloBLines_Male[0]="He'll build a wall and make ADVENT pay for it!"
PhotoboothSoloBLines_Male[1]="No weak points. No retreat."
PhotoboothSoloBLines_Male[2]="A shield is still a blunt object."
PhotoboothSoloBLines_Male[3]="The best offense is a good defense."

PhotoboothSoloBLines_Female[0]="She'll build a wall and make ADVENT pay for it!"
PhotoboothSoloBLines_Female[1]="No weak points. No retreat."
PhotoboothSoloBLines_Female[2]="A shield is still a blunt object."
PhotoboothSoloBLines_Female[3]="The best offense is a good defense."

[ShieldBashHoplite X2AbilityTemplate]
LocFriendlyName="盾牌冲击"
LocHelpText="用你的盾牌冲刺并击打敌人，造成一定伤害并将目标击退2格。可以与冲刺动作一起使用，并结束回合。"
LocLongDescription="用你的盾牌冲刺并击打敌人，造成一定伤害并将目标击退2格。使用时总是结束回合，并且可以与冲刺动作一起使用。"
LocFlyOverText="盾牌冲击"

[MZDefenseShift X2AbilityTemplate]
LocFriendlyName="守卫转换"
LocLongDescription="减少 <Ability:CLASSNAME/>的防御 <Ability:MZShiftDefense/>，但同时提高小队的防御力相同量。"
LocHelpText="减少 <Ability:CLASSNAME/>'的防御，但同时提高小队的防御力相同量。"
LocFlyOverText="守卫转换"
LocPromotionPopupText="<Bullet/> The <Ability:CLASSNAME/>'s bondmate recieves double the bonus.<br/><Bullet/> Ideal on heavily armoured soldiers in order to make foes favor targeting them."

[F_ProtectAndServe X2AbilityTemplate]
LocFriendlyName="守护与奉献"
LocFlyOverText="守护与奉献"
LocLongDescription="在使用众志成城或盾墙后获得一个非移动行动点。"
LocHelpText="在使用众志成城或盾墙后获得一个非移动行动点。"
LocPromotionPopupText="<Bullet/> 在使用众志成城或盾墙后获得一个非移动行动点。<br/><Bullet/> 被动技能。<br/>"

[IRI_Rider_Aegis X2AbilityTemplate]
LocFriendlyName="守护"
LocLongDescription="全体一心和盾墙现在减少 <Ability:AEGIS_DAMAGE_REDUCTION/> 的伤害，并将任何针对附近盟友的攻击转移到你身上。"
LocHelpText="全体一心和盾墙现在减少 <Ability:AEGIS_DAMAGE_REDUCTION/> 的伤害，并将任何针对附近盟友的攻击转移到你身上。"
LocPromotionPopupText="<Bullet/> <font color='#0bff9b'>弹道盾牌</font> and <font color='#0bff9b'>W.A.R.护甲</font>提供的盾墙也会受到影响。<br/><Bullet/> 守护效果影响直接相邻的盟友。对角线上的盟友不受影响。"
LocFlyOverText="守护"

[GrimyFlashpoint X2AbilityTemplate]
LocFriendlyName="闪光精通"
LocHelpText="每装备一个闪光弹，额外获得一个闪光弹，并且闪光弹现在造成2点额外伤害。"
LocLongDescription="每装备一个闪光弹，额外获得一个闪光弹，并且闪光弹现在造成2点额外伤害。"

[Brawler X2AbilityTemplate]
LocFriendlyName="斗殴者"
LocFlyOverText="斗殴者"
LocLongDescription="在四格范围内，对攻击的伤害减免 <Ability:BRAWLER_DR_PCT>%。"
LocHelpText="在四格范围内，对攻击的伤害减免 <Ability:BRAWLER_DR_PCT>%。"
LocPromotionPopupText="<Bullet/> 在四格范围内，对攻击的伤害减免 <Ability:BRAWLER_DR_PCT>%。<br/>"

; LWOTC Needs Translation (2)
[ImpactCompensation_LW X2AbilityTemplate]
LocFriendlyName="冲击补偿"
LocFlyOverText="冲击补偿"
LocLongDescription="受到伤害后，获得一个叠加的 <Ability:IMPACT_COMPENSATION_PCT_DR>% 伤害减免，持续到你的回合结束。最大叠加次数： <Ability:IMPACT_COMPENSATION_MAX_STACKS/>。"
LocHelpText="受到伤害后，获得一个叠加的 <Ability:IMPACT_COMPENSATION_PCT_DR>% 伤害减免，持续到你的回合结束。最大叠加次数： <Ability:IMPACT_COMPENSATION_MAX_STACKS/>。"
LocPromotionPopupText="<Bullet/> 提供随受伤害增加而增加的百分比伤害减免。<br/><Bullet/> 每回合开始时重置叠加次数。<br/><Bullet/> 叠加效果是乘法叠加的。"

[ImpactCompensationPassive_LW X2AbilityTemplate]
LocFriendlyName="冲击补偿"
LocFlyOverText="冲击补偿"
LocLongDescription="受到伤害后，获得一个叠加的 <Ability:IMPACT_COMPENSATION_PCT_DR>% 伤害减免，持续到你的回合结束。最大叠加次数： <Ability:IMPACT_COMPENSATION_MAX_STACKS/>。"
LocHelpText="受到伤害后，获得一个叠加的 <Ability:IMPACT_COMPENSATION_PCT_DR>% 伤害减免，持续到你的回合结束。最大叠加次数： <Ability:IMPACT_COMPENSATION_MAX_STACKS/>。"
; End Translation (2)
